{
"title": "Interpreters and Other Intermediaries",
"authors": [
"Cecilia Wadensjo"
],
"abstract": "<p><span>This chapter focuses on concepts like intermediary, mediator, gatekeeper and non-person. The presence of interpreters affects in certain ways - expected and unexpected-the communication between the expert and the layperson. In taking initiatives to defend their own interests, interpreters will necessarily influence the progression and the content of the current exchange. Concurrently with the compartmentalization and diversification of a society, the intermediary's role is routinized and subsequently professionalized. Gulliver describes mediators' strategic roles on a continuum, representing the range of strengths of interventions. A 'non-person' enjoys the privileges of being able to address anyone or to ignore being addressed without causing a redefinition of the situation. To understand gatekeeping and gatekeepers in modern society it is necessary to study its inter-cultural, inter-ethnic and inter-lingual dimensions. Interpreting in face-to-face interaction is gradually becoming recognized as a part of the everyday life of public institutions. The number of research projects devoted specifically to this kind of interpreting is, however, still very small.</span></p>",
"content": "<p><mark id=\"inline-0\" class=\"inlineNote\">Whenever</mark> two person or parties wish to have some kind of exchange, and direct contact is obstructed by a lack of knowledge, social mobility, mutual interest or language proficiency, there may be an apparent need for an intermediary, a need that can be satisfied given the parties' mutual acceptance of such an actor to assist them. Concurrently with the compartmentalization and diversification of a society, the intermediary's role is routinized and subsequently professionalized. People who are specifically trained and appointed to collection information on others' account and to speak on others' behalf have their place in a number of social activities, from commercial, political, and diplomatic encounters to court proceedings, counselling interviews and family therapy sessions.</p><p>This chapter will concentrate on concepts like <em>intermediary</em>, <em>mediator</em>, <em>gatekeeper</em>, and <mark id=\"inline-1\" class=\"inlineNote\"><em>non-person</em></mark>. Exploring how these notions are applied in a variety of scholarly literature, I will show that they have bearing on investigations or interpreter-mediated encounters. Some of the works discussed below deal with interpreting in face-to-face interaction specifically. In this literature, interpreters' 'mediation' is not necessarily presented as a phenomenon to be explored and described, but more often as something that must be prohibited, <mark id=\"inline-2\" class=\"inlineNote\">as 'unprofessional' behavior; as the individual interpreter's willful distortion or amateurish shortcomings.</mark> In these studies the individual interpreter is the basic unit of study, rather than the interpreter-mediated encounter.</p><p>As discussed in Chapter 2 above, the view of the interpreters' 'mediation' as 'something wrong' partly reflects myths about interpreting, founded in the <mark id=\"inline-3\" class=\"inlineNote\">monological preconception of language and mind.</mark> The image of the interpreter as a neutral channel and the idea of interpreting as a transfer of texts from one language to another belong in a monological theoretical frame. Consequently, the monological view of language and language use is occasionally present in literature on face-to-face interpreting. This becomes evident, for instance, when an 'erroneous' reality is 'corrected' against implicit or explicit norms.</p><p>&lt;h2&gt;1. It Takes Three To Make An Intermediary&lt;/h2&gt;</p><p><mark id=\"inline-4\" class=\"inlineNote\">Goffman (1990)</mark>, in an essay on <em>discrepant roles</em> (first published in 1959), draws attention to the fact that a person who mediates between two parties who are in one another's presence, displays behavior which would have appeared rather strange if one of the two had been absent. The organization of a situation is dependent on all parties involved in it and on how they relate to one another.</p><p>Considering this fact, it seems natural to follow Goffman's suggestion concerning the basic analytical unit when investigating a social role, namely <mark id=\"inline-5\" class=\"inlineNote\"><em>the group and its members</em></mark> (Goffman 1990:149). In the present case, this implies not the individual interpreter but the interpreter-mediated encounter. It takes a relevant audience to attribute someone a particular social role, <mark id=\"inline-6\" class=\"inlineNote\">and a certain mutuality in the interaction among members of this audience</mark>. The relevant audience of a performing interpreter are two or more persons who interact with one another in various languages with the assistance of the interpreter.</p><p>&lt;h3&gt;1.1 Intermediaries between majority and minority&lt;/h3&gt;</p><p><mark id=\"inline-7\" class=\"inlineNote\">Bailey (1969)</mark> building on a number of anthropological studies, discusses intermediaries' of 'middlemen's' function in societies with at least two political structures existing in parallel. These are, on a general level, characterized as a more dominant A-structure--as a rule the structure of the state or the majority culture--and a B-structure--a weaker enclave with the domains of this first A-structure. According to Bailey, intermediaries in these context can essentially be categorized by two different principles. On the one hand, one can distinguish between those who get their position from the stronger structure, who would be installed to guarantee its normative system, and those whose role is the result of initiatives taken by the weaker one.</p><p>On the other hand, Bailey discusses 'middlemen's' function from the point of view of their degree of independence in relation to the primary parties. Thus the 'pure messenger' would stand for the type of intermediary who is most dependent on primary parties and their actions, <mark id=\"inline-8\" class=\"inlineNote\">while the 'broker' is an actor with a stronger mandate, filling a more complex function with both a overview of, and influence over, the processes by which minority and majority groups intermingle.</mark></p><p>Differences in norms and basic values in the separate groups to a great extent condition the intermediary's activity. This also implies, as Bailey points out, that where negotiation is perceived to go wrong, parties tend to direct suspicion at the middleman. Intermediaries of the first category, appointed by the majority group, run the risk of being regarded as spies or traitors, and those appointed by the minority group risk being seen as renegades.</p><p><mark id=\"inline-9\" class=\"inlineNote\">Paine (1971)</mark>, another anthropologist, doing fieldwork in the Canadian Arctic, distinguishes, like Bailey, between 'brokers' and 'go-betweens'. To him, they signify intermediaries of different social status and influence. To act as a 'broker' would be to take more independent measures to initiate or promote negotiation, while a 'go-between' would only carry out initiative generated by the primary parties. The role of 'broker', it is said, is often combined with the role of 'patron', i.e. the spokesman, or 'big man' in a minority group. The spokesman, acting as the connecting link between the Inuit minority society and the Canadian majority society and its institutions, <mark id=\"inline-10\" class=\"inlineNote\">is delegated responsibility and power from both sides.</mark> Like Goffman (1990), Paine observes that the position in between is exceptional and potentially a powerful one for the person in the middle.</p><p>&lt;h3&gt;1.2 Myths about mediators' roles&lt;/h3&gt;</p><p><mark id=\"inline-11\" class=\"inlineNote\">Gulliver (1979)</mark> investigates the mediating process as such, related to a general theory of conflict and negotiation. He starts by remarking that the mediator's role(s) and function(a) have been largely ignored in sociology, as well as in psychology, game theory, or for the matter, his own discipline, anthropology. He is critical of what he sees as stereotyped and ethnocentric images of the mediator.</p><p>Among other things, he dismisses as a myth the idea that mediators are merely catalysts or that they, by definition as it were, act impartially (Gulliver 1979-211). In his view, this is more a belief, existing in relatively homogeneous Western societies, than a fact.</p><p>Another simplified presupposition is that a mediator's activity would consist just in making the parties collaborate towards a common goal instead of competing. In practice, Gulliver argues, intermediaries roles vary a lot. Moreover, there are variations not only in terms of the mediator's strategies and mandates. The situations where the intermediary third party would be expected and accepted also vary between cultures. Likewise, there are variations as to what determines his or her authority.</p><p>Gulliver describes mediators' strategic roles on a continuum, representing the range of strengths of interventions. In general, it is stated, <mark id=\"inline-12\" class=\"inlineNote\">a third party who is present at a negotiation will always exert some influence on the process.</mark> Gulliver suggests evaluating the status and role of the mediator firstly by reference to his or her possible <mark id=\"inline-13\" class=\"inlineNote\">personal interests in the issue at stake, and secondly, with regard to how, in that case, he or she would be an interested party.</mark> Gulliver emphasizes that in the evaluation of intermediaries one should count on the fact that their self-interest sometimes takes over the interest of one or both disputants (Gulliver 1979:217-20)</p><p>There are at least two points in Gulliver's investigation that could be significant for descriptions and explorations of institutional interpreter-mediated interaction. The presence of interpreters affects in certain ways--expected or unexpected--the communication between the expert and the layperson. As is well known to experienced interpreters, the kind of conversation implies potentially conflicting viewpoints between the primary parties thus often gives currency to the question of how to avoid siding with one or the other party. It is in the self-interest of interpreters to be impartial. In taking initiatives to defend their own interests, interpreters will necessarily influence the progression and the content of the current exchange. <mark id=\"inline-14\" class=\"inlineNote\">Does it happen at the expense of (one or both of) the primary parties?</mark></p><p>&lt;h3&gt;1.3 Formalized and spontaneous intermediaries&lt;/h3&gt;</p><p><em>Discrepant roles</em>, as defined in Goffman's (1990) essay mentioned above, are roles taken by and given to persons who control the validity of information in a given situation, or, <mark id=\"inline-15\" class=\"inlineNote\">more precisely, the kind of information by which a particular situation is defined by those present as being of a certain kind (e.g. a professional or private conversation, an informal chat of a formal interrogation.)</mark> Hence control also applies to the kind of talk that would be counted as appropriate and 'belonging' in the situation.</p><p>A general theme in Goffman's essay is that individuals are included or excluded in different situations through their social roles. These, in turn, are connected to the actors' presumed or actual access to each other's 'secrets'. This presupposes a fairly broad definition of secret. Almost all information in a social establishment, he argues, has something of an <em>excluding</em> function. In other words, what to someone is relevant information, is almost always none of someone else's business. The moral foundation for the intermediary's position is the very fact that they know 'secrets' of two separate groups (1990:141ff.)</p><p>In Goffman's definition, the 'go-between' or 'mediator' is a 'discrepant role' existing in a couple of quite different forms. For instance, he mentioned the foreman. As foreman, a person carries out an intermediary function between the workers and the management. This brings to mind what <mark id=\"inline-16\" class=\"inlineNote\">Giles and colleagues</mark> show about the non-institutionalized--but nevertheless fairly stable--intermediary roles that are taken be or given to nurses and other members of hospital staff in communication between doctors and patients (Giles <em>et al</em>. 1986). The chairperson of formally conducted meetings is another of Goffman's examples. Being in this role one has a responsibility to regulate interaction between those present, and in this way fill a mediator's function. The chairperson in fact serves as a visible model for those taking part in the encounter of how to attend to it.</p><p>The role of mediator is especially significant in multi-party interaction. <mark id=\"inline-17\" class=\"inlineNote\">Informal interaction, Goffman argues, can be seen as the formation and re-formation of teams, and the creation and re-creation of go-betweens. </mark>Those present will, in varying degree, show a concerned attention to the person speaking. From time to time, different persons will take responsibility for interpreting (in a broad sense) what is said, so that it will be included as a relevant contribution to common talk (Goffman 1990:150).</p><p>This phenomenon is perhaps particularly evident when someone is introduced into a situation when others present are already acquainted with one another, or when persons are treated as not fully competent to speak for themselves. An intermediary function is typically taken by or given to parents bringing a child to an expert, say a doctor, and speaking on the child's behalf, even when he or she is explicitly addressed.</p><p>&lt;h3&gt;1.4 Non-person--people present but treated as absent&lt;/h3&gt;</p><p>A discrepant role discussed at some length by Goffman (1990) is that of the <em>non-person</em>. In his definition, actors who play the role of 'non-person' are present during an encounter but in some respect do not take the role either of performer or of audience, nor do they pretend to be what they are not (as informers, decoys and sometimes detectives would do). A classic type of 'non-person' is the servant. This is an individual who, on the one hand, <mark id=\"inline-18\" class=\"inlineNote\">is expected to be present at particular occasions, and, on the other, is defined in certain way as someone who is not there (1990:10).</mark> Other examples would be the very young, the very old, the sick and, sometimes, the foreigner, who is believed not to understand, at some level, talk among people who share the same presuppositions, insights or means of communication. Participants can, from time to time, regard one another as sufficiently or non-sufficiently competent interlocutors.</p><p>As <mark id=\"inline-19\" class=\"inlineNote\">Aronsson (1991) </mark>demonstrates--drawing upon Goffman's sociopsychology and with the help of a paediatric case study--what a child says in a paediatric interview will be taken as a contribution to it by the adults, depending on whether the child is treated as fully present of not. In other words, negotiations in multi-party talk concern not only the meanings of utterances but, directly or indirectly, also personhood or non-personhood (Aronsson 1991:73). This is the role of 'non-person' regarded from the other's perspective. But as Goffman points out, one should not underestimates the degree to which the role of 'non-person' can be used as a defence. For instance, in a paediatric situation, this would imply that the child could choose to ignore others' talk and, when he or she felt like it, speak about whatever comes to mind, even at times when the adults expect the child to participate as a competent interlocutor. <mark id=\"inline-20\" class=\"inlineNote\">A 'non-person' enjoys the privileges of being able to address anyone or to ignore being addressed without causing a redefinition of the situation. </mark>Broadcasting technicians and photographers typically act as 'non-persons' in this respect, during public ceremonies like concerts and debates, when they take liberties to move about while the audience is supposed to take their seats, and to address anyone as though they were in charge of the event. They are present neither as audience nor as performers, but primarily as mediators, acting on behalf or a non-present audience.</p><p>In many respects, the concept of 'non-person' applies to the interpreter in face-to-face interaction. Interpreters play a kind of technical role and are counted as not fully present; there is an expectation that they will contribute nothing to the substance of the current conversation. But there are aspects of this profession that do not fit the description; most significantly, interpreters's talk conditions the talk of others (and vice-versa).</p><p>&lt;h3&gt;1.5 Gatekeepers -- intermediaries between lay people and institutions&lt;/h3&gt;</p><p>A considerable body of literature had been exploring what Erickson and Schultz (1982) term society's 'gatekeepers', that is, officials working with local bureaucracies that handle and distribute public resources. In their book <em>The Counsellor as Gatekeeper</em>, they investigate student counselling interviews. Other encounters of this kind might include job interview (e.g. Adelsward 1988) and interviews between social workers and their clients (e.g. Cedersund 1992, Sarangi and Slembrouck, 1996) Court trials, too, are a kind of gatekeeping encounter, as are in fact most meetings between lay people and administrators in charge of public goods, services and control functions.</p><p>Following Agar (1985) one may identify this kind of encounter as <em>institutional discourse</em> and observe in them three constituting phases, namely <em>diagnosis, report, directive</em>. 'Diagnosis' is the first, 'fact-finding' part, in which the client's problem(s) is identified and he or she is categorized in institutional terms by the professional party. In parallel, or as a conclusion, the professional compiles a 'report' which belongs to the body of documentation held by the institution. \"Directive', finally, concerns the measures recommended and decisions taken by the professional party. As Agar points out, the established institutional frames allow the professionals to make a limited number of diagnoses, report in certain established ways, and prepare for a circumscribed set of directives. This means that they will control the flow of information by introducing, reinforcing and excluding topics according to the rationalities of the institution. These are not always plain to see, and often enough not of primary interest to lay people, who therefore have comparatively less scope for controlling the situation (Agar 1985:150-2). <mark id=\"inline-22\" class=\"inlineNote\">The outcome of institutional encounters depends on the intermediary's ability, time and willingness to see the other's perspectives.</mark></p><p>To understand gatekeeping and gatekeepers in modern society it is necessary to study its inter-cultural, inter-ethnic and inter-lingual dimensions. Modern society bears the stamp of ongoing international migration, where the inclusion and exclusion of newcomers seems to be an everyday matter. The work of <mark id=\"inline-23\" class=\"inlineNote\">Gumperz and his associates (1982a; 1982b)</mark> significantly advances the academic study of ethnically and culturally mixed institutional discourse. The importance and fruitfulness of an inter-cultural approach has since repeatedly been shown, for instance in a recent work by <mark id=\"inline-24\" class=\"inlineNote\">Bremer and others (1996)</mark> reporting from a large European project on second language acquisition among minority workers. It is demonstrated that workers who otherwise spoke quite fluently had difficulties when they had to manage bureaucratic encounters, simply because they were unsure what information would be counted as relevant or irrelevant. From a wide variety of studies it is concluded that the outcome of encounters largely depends on how the minority clients (as patients, applicants, etc.) master what have become the bureaucratically acceptable and expected modes of communcation (cf Bremer <em>et al</em>. 1996). Even if the migrants had enough knowledge in the new language to lead a conversation, they had difficulties in deciphering the situations and their frames, to use a notion first-developed by the US social psychologist Bateson (1972) and subsequently utilized by Goffman (1974) and many of their followers.</p><p>Since meetings between lay people and representatives of public institutions follow a routinized pattern, explorations of daily encounters give information about how potential conflict of interest is handled on a daily basis. Investigating these encounters is this a way to shed light on the effects of public policy. Reading official documents, legal codes and job descriptions is one way to get information about the ideas behind the work of a bureaucracy and professional actors within it. Another way is to explore how official plans become routinized and rationalized in concrete encounters, how political meaning is interpreted and reproduced in practice.</p><p>As do all professionalized intermediaries, <mark id=\"inline-25\" class=\"inlineNote\">interpreters work at providing a particular <em>service</em>. Simultaneously, they -- of necessity--exercise a certain <em>control</em>.</mark> Obviously, there is a potential conflict between the service and the control aspects, which sometimes surfaces in dilemmas reported in the literature on institutional communication. It largely remains to be investigated how this conflict is handled in institutional interpreter-mediated talk, where the gatekeeping is, in effect, doubled.</p>",
"submissionBy": {
"name": "Marianne Bellotti",
"link": "www.bellotti.tech"
},
"notes": [
{
"id": "0",
"text": "This is an excerpt from Wadensjo' book <em>Interpreting As Interaction</em>. Part ethnography, part sociology, part linguistic study of the relationships between translators, their clients and civil society, thinking about how work in the context of computers and software is fascinating. Especially when so much basic translation is being done by machine (or language model) these days. I selected this passage because Wadensjo gives a really thorough and practical overview of the some foundational work in sociology around interaction patterns and strategy. "
},
{
"id": "1",
"text": "As we'll see later, a non-person in this context does not mean a machine."
},
{
"id": "2",
"text": "This is a reoccurring theme in Interpreting: the degree to which the expectation that the translator should just \"repeat what was said\" in a different language is completely unrealistic. Even accounting for the fact that most languages do not have one to one equivalences which each other, people have false stops, ambiguously worded sentences, long pointless digressions, etc, etc, etc. "
},
{
"id": "3",
"text": "the monological model is this notion that your meaning is derived entirely and completely from the words you say. Monologic assumed that understanding and meaning flows from the speaker to the listener. By contrast the dialogical model of communication says meaning is part of a collaboration between two parties communicating. You say something, but my interpretation of what you mean may be different than what you intended. Much of our communication is attempting to align our meanings. Wadensjo subscribes to the dialogical model."
},
{
"id": "4",
"text": "Erving Goffman and the title of this essay (which Wadensjo will refer to several times) is 'The presentation of self in everyday life'"
},
{
"id": "5",
"text": "This is revisiting a discussion from an earlier chapter: Wadensjo goes into Georg Simmel's model of dyads and triads and the difference between a 3rd party acting as a conduit through which two parties communicate with each other (a dyad) or whether the third party influences the nature of the ideas expressed (a triad). This is a particularly important question in software that gets developed further in this chapter. We assume that technology is neutral but we often program it to \"take sides\" as it were--giving one party more information, actively collaborating to create the understanding, or restricting the abilities of the two parties to have a dialogical interaction. When we assume technology is just infrastructure but design it with functionality the makes it part of a triad its behaviors and usage patterns can take us by surprise."
},
{
"id": "6",
"text": "There's also the question of mutuality and consent. When we build technology to be a third party, to what extent have we given the other parties the ability to establish mutuality and agree to collaborate with the technology on communicating? A lot of the frustration we experience around automated/robot systems (from phone menus to kiosks) come from being unable to establish mutuality with the machine, we're forced into a routine where collaboration is needed (for example I have a problem but I don't know the proper department or key words are to navigate the automated system) but collaboration is impossible."
},
{
"id": "7",
"text": "F. G. Bailey. And the work being referenced here is 'Stratagems and Spoils: A Social Anthropology of Politics'"
},
{
"id": "8",
"text": "Here we acknowledge that third parties are rarely completely neutral and call out that some people actively pursue this role (broker) in order to use the leverage and influence it will bring them to build their own social capital.</br></br>\nIn technology we can see similar issues as startups look to digitalize our analog interactions and then resell our metadata or otherwise leverage the influence their third party status affords them."
},
{
"id": "9",
"text": "Robert Paine"
},
{
"id": "10",
"text": "So a good question to ask when designing software is: what responsibilities are being delegated to the software, by whom and how do we communicate that fact to all parties concerned?"
},
{
"id": "11",
"text": "P. H. Gulliver, another Canadian anthropologist. The work referenced here is <em>Disputes and Negotiations. A \n Cross Cultural Perspective.</em>"
},
{
"id": "12",
"text": "including machines!"
},
{
"id": "13",
"text": "Machines do not have personal interests, but all machines are designed and built by people who absolutely do. The fact that sometimes the person behind the technology is not present to be observed complicates matters but one has to keep in mind that technology is not neutral because third parties by definition are not neutral."
},
{
"id": "14",
"text": "One sees a similar dynamic in journalism where trying to be \"unbiased\" leads to unfairly boosting the messaging of fringe groups. "
},
{
"id": "15",
"text": "In other words, the presence of a third party at all can alter the perceived formality of the interaction and change what people try to say. Wadensjo is writing about translators here. Using a neighbor of family friend as an interpreter to talk to the police (for example) suggests a different conversation than using a professional interpreter.</br></br>\nBut the same can also be said for technology. The choice to communicate via text message or email can change what people believe is appropriate or inappropriate to say."
},
{
"id": "16",
"text": "Howard Giles, Speech Accommodation Theory"
},
{
"id": "17",
"text": "I think we often develop more powerful insights about the usage and impact of technology by thinking of it as being part of a team with human operators, rather than a machine that simply makes things \"faster\" and \"easier\""
},
{
"id": "18",
"text": "The extent to which machines are 'non-persons' varies more than you might assume. The take away here is to ask yourself how much of the shared meaning the machine is contributing to the conversation (if the machine does not participate does the meaning of what people communicate to each other change?) and the degree to which the two parties in conversation are aware that the machine is collaborating with them.</br></br>\nIn a later chapter Wadensjo discusses who takes responsibility for maintaining a common understanding between parties. She uses this to explain how interpreters will sometimes deviate from a strict listen->translate interaction and participate more actively in the conversation in order to ensure mutual understanding is maintained. Some of our frustrations with technology, I think, come from technology's inability to take responsibility for shared understanding. Software can be quite rude: meddling in what we say be not taking any responsibility when its contributions cause us to misunderstand each other.</br></br>\nThinking about how your software does this and how to communicate those expectations to users can go a long way to improving the way people experience technology and the positive impacts it has."
},
{
"id": "19",
"text": "Karin Aronsson, we're starting to dip into what's called \"facework\" here. Wadensjo deep dives more properly into this concept in later chapters, but essentially \"facework\" is communication that happens to acknowledge and reassert social roles within an ongoing interaction. It's name comes from the expression \"saving face\".</br></br>\nFor example, you may add smiley faces and emojis to messages in order to ensure the content around those symbols is interpreted correctly (friendly, teasing, playful). You might apologize automatically for \"rudeness\" even when the person you are talking to does not seem offended because doing so reaffirms your good intentions. It would be a mistake to see communication between two parties as just the exchange of factual information. We make all kinds of little gestures deliberately and proactively in our communication that do not add any factual information but help the receiver interpret our meaning correctly. The extent to which any technology enables or restricts facework determines how effectively people can communicate on it."
},
{
"id": "20",
"text": "Being a 'non-person' is not necessarily negative. The general gist of these theories is that parties in the communication choose or are assigned roles within the communication that determine their contribution to shared understanding. Through-out the conversation these roles are regularly re-established and acknowledged ... almost like SYN-ACK ;)"
},
{
"id": "21",
"text": "The Counselor as Gatekeeper"
},
{
"id": "22",
"text": "We often gravitate towards \"automating\" these gatekeeping functions because they seem so easy to express in programmable rules. Wadensjo is pointing out that while the institution thinks this way, in actuality the gatekeeper can exercise a lot of discretion in working with the user to redefine the query (and therefore the route of the request) and that this contribution can change outcomes and experiences pretty dramatically.</br></br>\nWhile technology \"never gets tired\" it also lacks willingness to engage and exercise such discretion. Instead we push that back onto the user and ask them to navigate the gatekeeper via trial and error until they get what they think is the correct outcome (something that they might not be able to actually determine given their limited knowledge and visibility into the institution)."
},
{
"id": "23",
"text": "<em>Discourse Strategies</em> and <em>Language and Social Identity</em> respectively."
},
{
"id": "24",
"text": "<em>Achieving Understanding: Discourse in Intercultural Encounters</em>"
},
{
"id": "25",
"text": "This is a good model to start with when designing a piece of technology. What is the service is it supposed to provide? What behaviors and access does it restrict (control)? To what extent do those two things conflict and what takes priority when they do?"
}
],
"references": [],
"works": [],
"tags": [
"sociology",
"psychology",
"anthropology",
"human computer interaction",
"translation"
]
}