{
    "title": "Mental Procedures in Real-Life Tasks: A Case of Electronic Trouble Shooting",
    "authors": [
    "Jens Rasmussen",
    "A. Jensen"
    ],
    "abstract": "<p>The mental procedures used by skilled electronics repair men in their normal working environment have been studied by analysis of verbal protocols. The procedures found are organized as a search through a system which is viewed as a hierarchy of subunits. The general structure of the search can be broken down into a sequence of recurrent search routines. Basically different typos of such routines are found with great differences in respect to the number of observations needed and the complexity of the mental data processing involved. They also differ greatly with respect to the depth of knowledge of the internal functioning of the system used by the repair men. The records demonstrate a great ability by the men to conduct the search by general routines mostly depending upon their general professional background, and a preference for rapid streams of simple decisions giving good or bad judgments regard less of whether observations are informationally redundant or not. Seen from the viewpoint of information economy, the procedures are inefficient, but if the men are supposed to minimize the time spent ill the task and the mental load involved, the procedures are very rational. The records indicate that the men have great confidence in the experience that the general routines will ultimately lead them to the fault. In cases where they are unsuccessful, there seems to be a fixation, resulting in a tendency to rely on repetitions, rather than to generate specific procedures based upon reasoning related to the functioning of the specific system.</p>",
    "content": "<h2>1. <mark id=\"inline-0\" class=\"inlineNote\">INTRODUCTION</mark></h2><p>The task of a man operating any technical system is to select from the information presented to him by the system the data relevant to his current goal and to transform this information into a set of manipulations appropriate to his goal. This transformation depends not only upon the data which describe the actual state of the system, but also upon a mental model describing the system and its behaviour. The presence of a mental model is taken as given, since meaningful data-processing basically has to be based upon a representation of the constraints which the system impose upon the interrelation of the data it presents. The role of such a model has been discussed by Craik (1943).</p><p>On the basis of such mental models the skilled operator will have a set of algorithms or procedures for the data transformation enabling him to predict the outcome of his decisions and thus to plan his actions. The transformation models used by an ordinary car driver will be completely different from the models available to the car designer, and somewhere between these extremes in dependence upon the internal anatomy and functioning of the car, are the models used by the repair man.</p><p>Furthermore, the transformation models and procedures used by a man may change, depending upon his actual work situation. <mark id=\"inline-1\" class=\"inlineNote\">In frequent, recurrent tasks, the operator in a process control room may be expected to work 'from the expression on the face' of the system; that is, to apply subconscious procedures based upon recognition and experience, like the car driver: whereas, in infrequent and unique diagnostic situations, he will have to place his attention inside the system and consciously relate his mental models to the internal anatomy and functioning of the system.The subconscious procedures used in recurrent routines can be based upon the high parallel data capacity of man's 'peripheral system' whereas the unique tasks call for the slow, low-capacity sequential data handling in his 'central processor'.</mark></p><p>The system designer planning the man-machine interface to fit the mental procedures and limitations of man thus has to accept the variability in models and methods used by a man operating a system in a real-life task. The designer not only has to know the basic nature of these models and procedures, but he also has to be aware of the factors influencing the man's choice between different procedures.</p><p>Very little information is available to system designers about mental procedures used by system operators in real-life tasks. Due to the human adapt ability it is necessary to carry out studies in the actual working conditions of a group of trained operators. To generalize from clear-cut laboratory experiments which strip the task from seemingly secondary factors may be unreliable, even when studying trained operators. The choice among different procedures available to an operator can be expected to depend heavily upon his subjective formulation of the task and performance criteria, both of which will most probably change in the artificial atmosphere of a laboratory experiment. A further complication is that a behavioristic study based upon a recording of the information selected by the man and his external responses will not be reliable since the data gained may be related to the several basically different procedures, which can be underlying man's behaviour. <mark id=\"inline-2\" class=\"inlineNote\">We have found that the only way to separate the different data handling procedures and to relate them to the actual working conditions is in some way to ask the operator what he is doing. This means, however, that reliable quantitative information will be difficult to obtain, and the analysis will be time-consuming and will require much subjective judgment.</mark></p><p>Important results have been published on electronic trouble shooting by Rigney et al. (1967-68), and Dale (1957), and results from experiments on decision making as obtained by John (1957) are important in our context. The scope of our work is to have a qualitative formulation of the mental procedures evolving in the actual working condition of trained men, to be able to judge when and how the results from such experiments, which are typically constrained by use of untrained subjects, by behavioristic methodology, by artificial working conditions or by judgment of the performance against an informationally rational model of man, can be used in planning the conditions of a real-life task.</p><h2>2. EXPERIMENTAL METHOD</h2><p>As part of our experimental program to formulate the data handling procedures in real-life conditions, we have carried out a study of the procedures used by electronic maintenance technicians performing normal task of repairing the variety of electronic instruments used by a nuclear research establishment. An important advantage during the study was a close personal contact and working relationship between the people conducting the experiments and the repair men, and a natural interest in a maintenance group of a scientific institute to be involved directly in a research program related to its own professional methodology.</p><p>To get a qualitative formulation of the basic features of the diagnostic procedure rather than quantitative data from standardized experiments, records were taken of several individuals locating different faults in the instruments. This condition also improved the confidence among the technicians in the stated aim of the study since it removed the possibility of a comparison of the efficiency shown in the different cases. A total of 45 cases were recorded, 30 of which were analyzed in detail, covering 6 individuals performing fault finding in 8 different types of instruments, each instrument having its particular fault. The experiment thus covers a low number of cases and a very high number of parameters influencing the performance during the task, and reliable quantitative information i~ not to be expected.</p><p>In this case, we found it appropriate to do the study by asking the technician to verbalize his procedures during a repair, i.e. to take a tape recording while he was thinking aloud. The men were asked to relax and tell what they were thinking, feeling and doing, and to express themselves in everyday terms including short hints in fast work sequences. A record was immediately typed out and the man was asked to read it in the actual working position in front of the instrument to correct mistakes and supply supplementary information when he felt something was missing. At the same time the analyst had the first review of the record and a short talk with the man to clarify weak passages in the verbalization.</p><p>The initial systematic analysis was based upon the definition of a set of elementary events describing the micro structure of the sequences. The records were coded and a computer print-out made, giving a graphical picture of the sequence as well as a connectivity matrix describing each case. The graphical read-out turned out to be a convenient support in the effort to locate and identify recurrent routines. Owing to the large number of parameters, the connectivity matrices gave only very few hints about the general pattern.</p><p>Sequences identified as recurrent routines from the graphic readout were re-analyzed from the original records and classified according to the characteristics of the data handling taking place. The analyses started by extracting the most obvious and frequent routines, leaving for later analysis the complicated and more individual parts of the records. Contributing greatly to the amount of work was the necessity for a highly iterative classification; each new class of routines which was introduced made it necessary to review all classes already used. For each subroutine a graphic symbol was chosen, with a set of codes indicating important features. The records were finally coded as a flow diagram showing the interconnection of the subroutines and with comments to facilitate later reviews.</p><p>During our analysis we found that the following interferences from the verbalizing task may cause uncertainty during classifications of subroutines.</p><p><mark id=\"inline-3\" class=\"inlineNote\">It may be more attractive to the man to do something physically, to manipulate, than to use mental activities such as reasoning because action is more readily explained in the record and better fitted to the pace of speech.</mark></p><p>Sometimes we get the impression that activities reported sequentially would normally be part of a parallel processing. For instance faulty features in a visual display, which may normally be found immediately by recognition, are reported as found by a visual, sequential search, or automated routines are reported, which are normally subconscious and do not interfere with the mental activities. <mark id=\"inline-4\" class=\"inlineNote\">Thus a routine may be disturbed because it is forced into consciousness, and therefore the record may be erroneous and incomplete.</mark></p><p>Some of the protocols indicate that the men subconsciously collect information in parallel with the reported activities and that such information supports ' bright ideas ' which are difficult to explain later in the sequence. In some cases ' feelings ' of the location of the fault are stated, which are contradictory to the observations just recorded, but nevertheless correct and in agreement with information which the man, according to the earlier recorded procedure did not mention.</p><p>However, careful discussion with the men after the analysis of the records does not indicate a serious misinterpretation of the general structure of the procedures. <mark id=\"inline-5\" class=\"inlineNote\">After becoming accustomed to the recorder, the men found the execution of the task as well as the time spent to locate the faults to be normal.</mark></p><p>It was important that the analysts have a background in engineering for them to imagine themselves in the task situation and have a clear understanding of the meaning of the manipulations and measurements. They can then formulate what the man is doing, and thus find the structure in the information handling. On the other hand, a background in psychology is needed to explain why the man has chosen that particular approach and to formulate the goal and motivation which control the sequences found. The present report will consider mainly the structure of his information handling procedures. Our experience confirms the statement by <mark id=\"inline-6\" class=\"inlineNote\">Bainbridge</mark> et al. (1968) that a very formalized analysis in which the procedure of the man is compared to a model covering all possible strategies is impracticable for reallife conditions, although it is a very effective tool in laboratory experiments with a lower number of decisive parameters, as reported by Newell (1968).</p><h2>3. THE STRUCTURE OF THE SEARCH PROCEDURES</h2><p>A discussion of the results of the analysis of our records may benefit from a simplified example based upon the main features of one of the actual cases. We consider a case where a digital scaler displays two digits simultaneously in one decade, but otherwise functions normally. The task is now to obtain a reference to the location of the faulty component from the response of the system and by appropriate measurements. In the present case, there is a close relation between the faulty parameter of the system response—i.e. the fault in display of the second decade—and a well-defined part of the system. The interest of the man will then quite naturally be limited to the circuitry connected with the second decade. Further reference to the location of the fault may now be obtained in different ways. It may be based upon detailed observations of the actual faulty response and consideration of the internal anatomy and functioning of the system. In the actual case, a design engineer localized the fault to a specific resistor in the decoder directly from the response, using his knowledge of the digital code and a diagram of the circuitry of the decoder. This method can, of course, also be chosen by a trained maintenance man and, judging from textbooks for the training of maintenance technicians, <mark id=\"inline-7\" class=\"inlineNote\">some authors of such books consider it to be the 'intelligent' method</mark>: i.e. to take a few, carefully chosen measurements and use the observations in careful reasoning based upon a functional understanding of the system. Our records indicate that a trained technician will most likely choose another method: he will scan through the faulty decade by a rapid sequence of good/bad checks of the actual signals against normal signals which are measured in one of the other decades, or which are found on the circuit diagram. In this way, the fault may be localized to the decoding circuit. In the circuit diagram, this circuit is seen to contain less than half a dozen resistors. Therefore, rather than evaluate their function, <mark id=\"inline-8\" class=\"inlineNote\">it may be preferred to scan through the resistors by good/bad checks with a ohm meter</mark>. Thus, an open circuit resistor is found.</p><p>Although very simplified, this example illustrates some of the general features of the procedures found in our records.</p><p>The records indicate that a trained technician sees his task as that of locating a fault in a system he knows has been functioning properly: i.e. to find where the discrepancy between the normal and the actual system state is to be found, rather than to explain why the system has the observed faulty response. His immediate goal is thus to derive from his observations a topographic reference to the location of the faulty component. This may be done typically in three different ways resulting in three different recurrent search routines. We have called these (1) topographic search, ~2) functional search, and (3) search by fault evaluation.</p><p>The procedures are organized as a search through a system which is viewed as a hierarchy of units. The system is composed of a number of subsystems: amplifiers, scalers, deflection generators, etc. Each sub system has easily identified units such as amplifier stages, flip-flops, and oscillators, and these units have components, e.g. transistors, capacitors, and resistors.</p><p>The general structure of the search can be broken down into a sequence of search routines, which are used to identify the appropriate subsystem, stage, or component.</p><p>The basic feature of the routines used may vary greatly in several aspects. In the example given above, the designer used only a few observations, but employed a complex data handling in his decision procedure. His procedure is very specific and related to the system anatomy and internal functioning and to the actual faulty condition. He treats several observations simultaneously, and his procedure is informationally economic. The trained technician uses many observations in a sequence of simple decisions. His method is a general search procedure which is not dependent upon the actual system or specific fault. He treats the observations individually in a stream of good/bad judgments which is informationally uneconomic, but fast.</p><p>The mental data handling necessarily implies that the man has available some sort of mental model of the system and a procedure to make this model operate upon the data observed. The mental model as well as the procedure may be supported by external means such as diagrams, drawings, instructions, and rules. In the following sections the three typical search procedures and the type of mental model used are discussed.</p><h3>3.1. Topographic Search</h3><p>In a topographic search, reference to the location of the fault is obtained from the topographic location of the measuring points. The system or some part of it is scanned by a sequence of measurements, and the observations are subject to simple, individual good/bad judgments. The fault will then normally be found in a part of the system around the location of a single judgment.<mark id=\"inline-9\" class=\"inlineNote\"> If, for example, the fault is located in an amplifier, the signal is traced stage wise through the amplifier and the interest focused upon the stage in which the signal disappears.</mark> The search is thus a stream of good/bad judgments along the main signal path in the system considered. The route of search is normally controlled by the circuit diagram and the measuring points chosen where normal signals or bias voltages are stated in the diagram. The circuit diagram is seen as a topographic map of the system, not as a functional description. This is generally indicated by the wording in the protocols, but in one case the lay out of a schematic diagram leads the man tracing a pulse signal forward through a circuit to continue the tracing backwards through another, connected circuit, not noticing that two circuits drawn in line, back to back, in the diagram, actually were functionally independent circuits in parallel.</p><p>A slightly different version of the topographic search is used when the fault has to be located in a cascade of different subsystems. The measuring points for good/bad checks are then selected individually between the sub systems (like the split half search). The topographic search is the preferred procedure and is normally efficient, though repetition by different parameters may be necessary. <mark id=\"inline-10\" class=\"inlineNote\">However, it can cause difficulties with some types of faults and systems, typically in the case of faults within closed feed-back loops.</mark></p><p>In about 70% of the 82 topographic search routines found in our protocols, the field of the search is chosen due to a previous topographic search, a functional search, or due to a decision to repeat the search This occurs nearly equally frequently. The fields for the remaining searches are equally frequently found by evaluation of the specific fault or by a search by individual check measurements (split half).</p><p>In a topographic search, the search procedure consisting of a sequence of good/bad judgments is very general. The mental model of the system used for the search has to supply the man with an appropriate route for search and <mark id=\"inline-11\" class=\"inlineNote\">reference data for his judgments</mark>. If a circuit diagram is available which clearly indicates the main signal path and gives sufficient data for normal bias voltages and signals, the mental model needed by the man has only to support him in the topographic correlation between the diagram and the system. His mental model needs to be based only upon his professional experience with the visual appearance of typical components and circuits and with the normal lay-out of the circuitry. This is the case in practically speaking all the topographic search routines found in our records In 70% of the routines, the route is supported by the circuit diagram which is viewed as a topographic map.</p><p>The normal bias and signal data given in the diagram are used as reference data for the judgments whenever available. In nearly all the remaining sequences without specific reference data, the observations are compared with values based on general experience such as voltage magnitudes or wave forms in elementary transistor or vacuum tube circuits, or reference measurements are taken from other similar, normal circuits in the system.</p><p>Appropriate routes for search or reference data for judgments may not always be immediately available in this way. This is true, for example, for digital circuitry performing logic operations which combine or modify coded pulse signals. Such circuitry has several information routes with common crossroads, and very often the signals look normal when judged individually, but are present in faulty combinations or codings. <mark id=\"inline-12\" class=\"inlineNote\">In such cases other types of search have to be used, or the route and the reference data for topographic search have to be planned or deduced from an understanding of the internal functioning of the system by employing a mental model of the specific system anatomy and functioning.</mark> This model is also normally supported by the circuit diagram which is now seen as a functional description. Topographic search supported in this way is found only in very few of our cases.</p><p>Nearly 40% of the topographic searches are successful and initiate a local search. If the search is unsuccessful, a variety of decisions are found, for instance to return to a previous indication or activity (23%), to repeat the search (17%) or to take a break (10%).</p><h3>3.2. Functional Search</h3><p>In the functional search, the topographic reference is obtained from the <mark id=\"inline-13\" class=\"inlineNote\">normal functional relation between a feature in the system's response and a specific part of the system</mark>.</p><p>A good example is trouble shooting in a TV receiver. The man will scan the features of the picture in a stream of good/bad judgments and turn his interest to the subsystem related to the faulty feature. If the picture is two low, he will perform a search in the vertical deflection generator. The functional search is quite naturally the opening move in complex systems having subsystems with specific functions which are individually recognizable in the overall system's response. However, the routine may also be used later in the procedure when the man is faced with more complex data patterns such as wave forms on oscilloscopes.</p><p>Our records also show a clear ability of the men to base their functional search upon very general mental models of the system. If an instrument such as a TV receiver, an oscilloscope, or a digital system has a rather complex external response pattern, the man will scan familiar features in the response by a sequence of good/bad judgments. If he meets a faulty response feature, a general 'block-diagram understanding' of the system can refer the man to the related subsystem. If this is a topographically well-defined part of the system, his attention will immediately switch to this system in order to perform a routine search. <mark id=\"inline-14\" class=\"inlineNote\">Additional information in the system response is generally not used, even if it points to a more specific location of the fault or indicates an efficient search procedure, but calls in turn for more careful reasoning related to the specific mode of failure and the internal functioning of the circuitry.</mark> The men do not seem to be prepared to use this possibility. Even when such faults were simulated, so that the system's response clearly indicated possible short cut methods to the planners of the experiments if the internal functioning of the system was considered, the men normally used their general search routines.</p><p>In nearly 70% of the 31 functional search routines found in our protocols, and which are typically the opening move, the failed function alone referred the man to the location of the next search. In 25% further location for the next search was supported—equally frequently—by evaluation of the fault or by single check-measurements. In 35% of the routines the mode of the fault supported the choice of the parameter or signal to use in the following search.</p><p>In their pure form, topographic and functional searches depend merely upon good/bad judgments of the observed data. A more specific determination of the fault from the observations will clearly be possible only if the information which describes the actual mode of failure is taken into consideration.</p><h3>3.3. Search by Evaluation of a Fault</h3><p>Search by evaluation of a fault is used when the man derives the topographic reference from the actual faulty response. This derivation implies an analysis of the observed information with respect to the specific instruments and its actual state of operation. This transformation may be illustrated as follows.</p><p>Observation (i.e. data observed describing failed state) --&gt; Cause (i.e. what is changed in internal signals or functions)--&gt; Location (i.e., where is the faulty component resulting in the specific malfunction).</p><p>To be able to make such transformations, the man has to use mental models of the system relating changes in internal signals, parts, or components to the changes observed in system response.</p><p>Clearly such transformations will be much more varied in their individual appearance than are the routine search procedures. Also the complexity of the transformations varies greatly from rapid statements based upon recognition from previous cases to more complex deductions based upon several parameters and careful consideration of the internal system functioning and anatomy.</p><p>Most of the transformations based upon evaluation of fault found in our records are rapid statements based upon general professional experience. For illustrative purposes a few examples are given as follows. The experience is classified here in three types related to (a) the specific type of system, (b) the general behaviour of electronic circuitry, and (c) the typical failure mode of components.</p><p>(a) Experience with specific systems plays a less important role in our records than would be expected from ' old boys in the trade ', because the choice of systems during the experiments was such that it would not allow the man to go directly to the fault by mere recognition. <mark id=\"inline-15\" class=\"inlineNote\">This choice was made to study general features of the search procedures and thus avoid too much influence from experience characterizing a specific man-instrument relationship.</mark></p><p>(b) General electronic experience independent of the specific type of system. Typical samples are: Observation: woolly or fuzzy wave form by oscilloscope measurement What: mains ripple. Observation: signal compressed. --&gt; What: short circuit. Observation: unstable wave form from flip-flop circuit. -- &gt; What: faulty trigger signal, etc.</p><p>(c) Experience with component fault rate or mode, which is also independent of the specific system. Examples are: What: short circuit --&gt; Where: cable connector. What: faulty triggering of flip-flop --&gt; Where: trigger diode 'blown'. Observation: low bias voltage --&gt; Where: short circuit in transistor.</p><p>Such statements are generally expressed as recognitions. The transformations based upon conscious reasoning related to internal functioning of the system are complex and difficult to keep pace with during verbalization, and the protocols only indicate the surface of the activity, but judged from the intermediate steps in the reasoning and the nature of the observations used, at least two groups of procedures seem to be used. The transformations based upon conscious reasoning have the character of mental search procedures.</p><p>In one type the man seems to be working from inside the system outwards to the response in a way which could be illustrated as follows. c Establish a mental model of the normal system anatomy, its signals and functioning by examination of diagrams or by memorizing. Then make a guess as to which signal or component would reasonably be involved in the faulty response. Modify the model accordingly and evaluate the resulting response pattern. Compare with the observed data to judge the relevance of the guess.' The procedure may be called a mental functional search. This sort of procedure is most clearly expressed when the hypothesis is not a guess, but when the fault is found by another search procedure and the result is tested against system's response by functional reasoning.</p><p>In other cases, the man is working from response data into the interior of the system. The procedure looks like a mental topographic search. From the response pattern and an understanding of the system, the absence or presence of a normal signal or system state along a chosen search route is deduced by functional reasoning. <mark id=\"inline-16\" class=\"inlineNote\">The main difference from the normal topographic search is that the data, which are subject to individual judgment, are not measured directly, but deduced from the system's response.</mark></p><p>The functional and the topographic search routines in their stereotyped form are only able to give a topographic reference—to indicate where to look next. The search by evaluation of the fault is dealing with the actual internal functioning of the system and can therefore, in addition to a topographic reference, give information about what to look for (i.e. which signal to use for further search), or it may be used to confirm a topographic reference found by other means.</p><p>The source of data used for search by evaluation of the fault can be observations made during topographical and functional search, or measurements planned individually to give such information. The most important source found in our records is observations which are also used for good/bad judgments during routine search, and in most cases the evaluation follows immediately after the observation. A smaller part is based upon observations made during a previous stage of the procedure, and in such cases a repetition of the observations is as frequent as a recall of the data.</p><p>Also in the search by evaluation of the actual fault mode, our records show a preference for use of transformation models which are not closely related to the specific system. In 80 evaluation routines, nearly 70% is expressed as rapid statements, typically based upon a single observation and classified as a recognition based upon general professional background or experience. <mark id=\"inline-17\" class=\"inlineNote\">Only about 20% of the evaluations indicates more careful reasoning based upon a mental model related to the internal functioning of the specific system.</mark></p><p>In 30% of the evaluations, the result is a hypothesis regarding the location of the fault—' where to look '—in 50% a hypothesis regarding the parameter or signal to use for further search—'what to look for'. ln nearly 15% the evaluation is used to verify a hypothesis found otherwise. In 30% of the evaluations, the result is tested by a check measurement.</p><h3>3.4. Check Measurements</h3><p>Among the sequential routines in the records, a number of single measurements are dispersed at locations which are chosen individually in the system. Since such measurements typically are followed immediately by good/bad judgments, they are classified as check measurements. These play an important role in the overall search procedure; they are used either to confirm a hypothesis or as part of an overall topographic limitation of the field as in a 'split-half' procedure. In our protocols, general electronic experience is most frequently used as a basis of judgments, this indicates that locations of check measurements are preferably chosen where norm data are immediately available.</p><p>Of a total of 75 check-measurements, 45% were used to confirm a reference to the location of the fault, 30% to confirm a hypothesis ' what to look for ' regarding the parameter to use in a search, and about 20% as individual measurements in an overall topographic search.</p><h3>3.5. Number of Search Routines in the Protocols</h3><p>The 30 protocols analyzed in detail cover 22 analog and 8 digital systems. The number of the recurrent routines vary greatly in the different cases. Thirty-one functional searches are normally the opening routines, as 21 protocols have only one functional search, 5 have none and 4 have from 2 to 4.</p><p>The use of the 82 topographic searches is more varied, the protocols contain typically 1-3 such sequences, but up to 8 sequences are found. The same distribution is found for the 87 evaluations of the fault mode. The 75 check-measurements are distributed with typically 1-5 checks per protocol although one case has 10 checks.</p><p>More detailed results are to be found elsewhere (Rasmussen and Jensen 1973).</p><h2>4. GENERAL ASPECTS OF THE PROCEDURES</h2><p>The previous discussion indicates that the mental procedures used in trouble shooting vary greatly in the depth of system knowledge needed as support. At one extreme, the man has procedures which are based only upon very general professional training and experience, at the other, he has procedures available which call for a very detailed knowledge of the specific system and the laws controlling its internal functioning. In our experiments, the records demonstrate a great ability by the men to get around their search problem by means of a sequence of general procedures mostly depending upon their general professional experience and background and not closely related to the specific instrument. Scanning a high number of observations by simple procedures is clearly preferred to the preparation of specific procedures by studying or memorizing the internal functioning of the system. <mark id=\"inline-18\" class=\"inlineNote\">The principle behind the procedures seems to be to choose ' the way of least resistance '.</mark></p><h3>4.1. Redundant Observations and Impulsive Decisions: Working Memory</h3><p>Other fundamental aspects of the procedures quite naturally follow the preference of the men for general methods not closely related to the specific system or its actual fault. A general procedure cannot, of course, be based upon very detailed information found in the observation or measurements. In particular general methods cannot take advantage of information contained in the specific relation between several observations. This is indicated clearly by the general features of the procedures found in our records.</p><p>The functional and the typographic search appear as functional or topographic good/bad mappings of the system. <mark id=\"inline-19\" class=\"inlineNote\">Practically speaking, all observations are immediately judged as good or bad</mark>, and only the results of the judgments normally control the next activity. In some cases, the parameters chosen for a topographic search cannot locate the fault, and information clearly indicating this may be recorded by the man prior to the decision to turn to that particular search. Often only the decision about where to look connects the routine to the previous search. During the search routines, no attention is paid to whether a measuring point will be informationally redundant or not. When specific information related to the actual mode of the faulty function is used by the man, he generally does not seem to have been looking for such information: instead, 'something shows up'. <mark id=\"inline-20\" class=\"inlineNote\">Often, important information is merely mentioned 'in passing' in a search routine, but sometimes it catches the attention of the man and causes him to switch to another procedure giving him a topographic reference as to 'where to look' or hints about what to look for.</mark></p><p>The dependence of the procedures upon individual observations and judgments corresponds to a general tendency found in the records. Instead of making overall plans for the search, the tendency is to make rapid or impulsive decisions all along the search based only upon the information observed at the moment. This, of course, gives a very individual pattern to the different overall procedures found in our cases. A main rule for the structuring of the procedures seems to be that as soon as an observation is found to give a topographic reference to ~ more restricted field for which a familiar search routine is at hand, a decision is taken to switch to that field. <mark id=\"inline-21\" class=\"inlineNote\">There seems to be a 'point of no return' in the attention of the man at the instant of this decision</mark> as discussed by Barlett (1958). Although more information in the observation is clearly available and recorded by the man indicating possible short-cut methods or important hints for the next search, the decision locks out the influence of such information, and the next search is a routine, starting from scratch.</p><p>Important features of the various search procedures available to the men are the basic difference in the amount of data needed by the procedures, and the complexity of the mental data handling task they impose upon the man. There is a complementary relation between these aspects of the routines. The very general procedures are based upon a rapid stream of good/bad judgments, and call for a large number of observations which are treated individually and then left behind. The system is mapped in a rather systematic way by such judgments, and this seems to be a convenient way to remember the results of past activities. A general impression is that during his search the man is well aware of his previous judgments. However, the originally observed data are discarded without subsequent recall, but, in some cases, they seem to build up unconsciously a sort of feeling which later in the procedure can initiate hypotheses appearing as good ideas. The very specific procedures based upon system anatomy and functioning require only a few observations, but the information handling, is complex, and simultaneous treatment of several observations and a considerable carryover of information may be needed in the short-term memory between the individual steps of the procedure.</p><h3>4.2. Mental Load from the Procedures</h3><p>This discussion focuses the attention upon mental load on the man during the task. As discussed thoroughly by Bruner et al. (1956), the mental procedures chosen by the man may be strongly influenced by the constraints he meets in his capacity for short-term memory and inference. The multiple task nature of trouble shooting may make this an important constraint. On a time-sharing basis, the man has to formulate his route for search through the system by use of a diagram or by reasoning; he has to locate the route in the real system, to manipulate measuring devices, to establish norms for his judgments from diagrams, experience, or functional reasoning, and he has to keep track of his overall search.</p><p>Several indications of high cognitive strain are found in the protocols. A good example is a topographic search in a digital system performing logic operations when the man has to plan the route and to generate reference standards for judgments by deduction from an understanding of the functioning of the circuitry. In this case, he has to maintain mental models at two different functional levels simultaneously, and this is a considerable task. A model at one level is necessary to control the route of search. This has to be related to the signal or information flow and thus the function within the entire sub system under consideration. Models at another level are needed to supply reference norms for the individual judgments, and these have to be related to the detailed functioning of the subunits along the search route. In this case, the procedure becomes slow and hesitating, and the man seems to be very insensitive to hints in the observations which would normally be familiar to him.</p><p>A tendency to avoid the load from functional reasoning may be the reason why DC-bias voltages are invariably preferred to AC-wave forms in analog system, when no reference data are given in the diagram. Judgment of DC bias voltages may be based upon genera] experience with tube or transistor parameters, whereas judgment of wave forms has to be based upon experience or understanding related to the specific type of circuit. The protocols give several indications that difficulties in one of the sub tasks tend to bring more simple procedures into use in others. This should be taken into careful consideration when generalizing from clear-cut laboratory experiments with special equipment which eliminates all secondary sub tasks.</p><h3>4.3. Fixations in Routine Search Procedures</h3><p>The protocols indicate that the men place a great deal of confidence in the experience that the general search routines will ultimately lead them to the fault; if a topographic search turns out to be unsuccessful and fails to result in local search, which is the case in more than one half of the attempts, the preferred decision is to repeat the search by another parameter. Typically, an unsuccessful search by DC-voltage measurements is followed by an AC sequence and vice versa. If this also turns out unsuccessfully, there is a pronounced tendency to return to a search performed earlier. This, however, seems to be a repetition with more careful judgements of the observations rather than a more careful evaluation of the actual faulty function. This is especially true if the man repeats the initial functional search; even then there is little tendency to use specific short-cut methods based upon functional reasoning. It should be stated that preference for these methods is not due to a lack of ability to carry out functional reasoning, but more likely to the fact that they are inherently attractive as they consist of fast sequences, which are normally successful in the end. The behaviour may be compared to that of most car drivers moving around in a big city who prefer to drive along familiar main streets rather than preparing individual short-cut routes by means of a city map.</p><p>If the general search routines in special cases ultimately turn out to be unsuccessful, the man often seems to ' be in trouble '. When in trouble, <mark id=\"inline-22\" class=\"inlineNote\">there is a tendency to rely on good ideas which admittedly seem to appear in most cases after a break or a period of confusion, removing fixations.</mark> The good ideas are difficult to trace. Sometimes, the man returns to deviations met in a previous search, but passed over without further consideration; sometimes he expresses ' a feeling that something is wrong around here ' which has grown from slight indications during earlier search sequences. In some cases important information has been recorded several times during routine search without triggering his attention until a period of confusion has arrived.</p><p><mark id=\"inline-23\" class=\"inlineNote\">When in trouble, there seems to be no tendency to consider it worthwhile studying the functioning of the circuitry in greater detail with the use of manuals or diagrams.</mark> During a discussion of the procedures found in the experiment, the technicians stated that as a rule they found the general search routines successful. Apart from ' block-diagram understanding ' of the system—which supports the functional search—it was not considered worthwhile studying the internal functioning of the circuitry: ' If you run into trouble, better take a break, wait until next day, or discuss the problem with a colleague '. Asked if they could suggest types of cases for which they would find it worthwhile studying the internal functioning of the system in detail, the technicians said that would be the case if measurements or manipulations could have serious con sequences, as in live warning systems—' when a siren is at the end of the wire ' or if the working conditions on site are unpleasant, e.g. arising from bad smells as in chemical plants. A test case in connection with the level control system in a radioactive waste tank system resulted in a very ' rational ' procedure based upon a careful functional evaluation of system response in advance and very few measurements on site. We also suggested to the technicians that they use functional reasoning when in trouble in the normal repair shop environment. This, however, did not cause any significant changes in the procedures used in the records made thereafter. The procedures seem to be so highly trained that they are difficult to change by suggestion of ' better procedures '. When a trouble shooting task is running, the man seems to be completely occupied by the task, and he does not ' remember ' the suggestion when difficulties arise. The test case with the waste tank system may indicate that, to change procedure, the man has to consider the task in advance as one calling for special treatment.</p><h3>4.4. Subjective Formulation of Task and Performance Criteria</h3><p>We now turn to the role of the subjective formulation of the task and performance criteria in the choice among the various search procedures available to the man. This aspect is especially important since the formulation of the trained repairman may be basically different from that of a design engineer who—nevertheless—will very often be responsible for preparing the working conditions for the repairman in the form of layout of systems, instruction, and operating manuals and diagrams.</p><p>Our protocols indicate clearly that the task is defined by the men primarily as a search to find where the fault originates in the system. He is faced with a system which he supposes has been working properly, and he is searching for the location of the discrepancy between normal and defective states. He does not see the task as a more general problem-solving task in order to explain why the system has the observed faulty response and to understand the actual functioning of the failed system.</p><p>On the other hand, the design engineer, with a background in laboratory development, will not normally in this work think in terms of standards for normal operation, but will consider it his task to understand the basic functioning of the system and to test observations during his experiment against his conceptual intentions.</p><p>Are the procedures found in our records rational? What is rational depends upon the performance criteria adopted by the men. Normally a reasonable criterion for a maintenance technician will be to locate the fault as quickly as possible, and only in special circumstances will his criterion be that of minimizing the number of measurements as discussed above. From this point of view, the procedures found in our records are rational since the faults were found within very reasonable times in most cases.</p><p><mark id=\"inline-24\" class=\"inlineNote\">The system designer with his theoretical background may quite naturally value as rational the ' elegant ' deductive procedure which is informationally very efficient and based upon few observations, but this criterion will not be an appropriate one to judge performance in real-life maintenance work. </mark>It is important that system designers preparing working conditions and involved with the training of maintenance personnel become aware of this difference in task formulation and performance criteria and have some knowledge of the procedures available to trained repairmen.</p><h2>5. CONCLUDING REMARKS</h2><p>In the present paper the mental procedures used by trouble shooters in their normal working conditions and studied by analysis of verbalized records are reported. A major result has been that procedures which will be found unsystematic in a behavioristic study may turn out to be rational and systematic when one listens to the man's verbalizations. The study shows that several different mental data handling procedures may be used by a man for the same real-life task, and that verbalized records can be an appropriate tool for the formulation and separation of the procedures.</p><p>The nature of the procedures found in our records, being simple mental procedures related to a sequence of observations, may be especially suited for verbalization. We have indications that great difficulties will appear when verbalization is used to study highly trained tasks implying parallel processing of information by pattern recognition and subconscious routines as well as tasks calling for complex reasoning.</p><p>However, rapid sequences of simple decisions based upon informationally redundant observations may be more characteristic for human problem solving than the great interest of psychologists in complex, rational problem solving leads one to expect.</p>",
    "submissionBy": {
    "name": "Marianne Bellotti",
    "link": "www.bellotti.tech"
    },
    "notes": [
    {
        "id": "0",
        "text": "There are many amazing Rasmussen papers--I'm particularly fond of his functional boundaries model and how great it is as a babystep for engineering teams wanting to get started with SLOs but not knowing how to do that--but I went with this one because it's a little less well known and I've been thinking and referencing it a lot when discussing how we onboard new engineers and transition knowledge."
    },
    {
        "id": "1",
        "text": "For fans of Thinking Fast and Slow: System 1 vs System 2, basically. I love how Rasmussen uses the language of data processing here because I think the key difference between System 1 and System 2 isn't speed per se but level of compression. Your brain uses heuristics to compress information."
    },
    {
        "id": "2",
        "text": "Otherwise known as user research ;)"
    },
    {
        "id": "3",
        "text": "This is called the Hawthorne effect: people behave differently when they know they are being watched. Rasmussen worries that their subjects were biased towards action because they were required to narrate for the researcher and its easier to describe what you're doing than it is to describe what you're thinking. Modern day user researchers try to mitigate this bias by asking the user questions about what they think."
    },
    {
        "id": "4",
        "text": "The real struggle with mental models is that most of them are subconscious. We don't deliberately think through the model we just have a sense of what 'feels right'. Getting people to articulate and document their models is a big challenge."
    },
    {
    "id": "5",
    "text": "...which is what most user researchers will tell you. The Hawthorne effect diminishes over time as people get used to being observed and relax. The more time a researcher spends with a subject, the more accurate the data. "
    },
    {
    "id": "6",
    "text": "The same Bainbridge who wrote Ironies of Automation, FYI"
    },
    {
    "id": "7",
    "text": "always a pleasure to find low key side-eye in academic papers. This is how people sub-tweeted in the 70s"
    },
    {
    "id": "8",
    "text": "Essentially these are manual unit tests."
    },
    {
    "id": "9",
    "text": "The equivalent in software would be using something like a control-flow graph or a stack trace to map the movement of data through the landscape of code."
    },
    {
    "id": "10",
    "text": "What he's getting at here is because a closed loop system feeds the output of the process by into the loop as input, the bug might actually be the result of many iterations of the same process ... in which case, navigating the system by tracing a path from component to component looking for an error might be inefficient."
    },
    {
    "id": "11",
    "text": "As Bainbridge would note: experience operating a system is invaluable for judging the health and correctness of its operations at any particular time. This is why it's so difficult to onboard to a new system with documentation alone. Documentation often gives the routes and topography but not the reference data. Good unit tests (or really any tests) can backfill some of that, but operation experience works best."
    },
    {
    "id": "12",
    "text": "We often think of expertise as coming from a complete model of the system and we try to build expertise by increasing the level of detail and complexity of one global model (or architectural diagram, or documentation, or what-have-you). What I think is so important about this paper is that Rasmussen is saying \"No, it's toggling between small and simple models\" The expert has a robust library of small and simple models of the system and switches between approaches in order to refine the search area until the problem is found."
    },
    {
    "id": "13",
    "text": "In other words, if you know the problem is with querying the database you go directly to the parts of the control flow graph that touch the database."
    },
    {
    "id": "14",
    "text": "Again Rasmussen emphasizes that simple models or more efficient than detailed ones. Here he offers a partial explanation as to why: the trade off between better search criteria and the cognitive load of using the more detailed model often do not make sense. You waste the advantages of more detail by having to think harder about everything."
    },
    {
    "id": "15",
    "text": "One presumes that because they didn't have enough operators of a signal specific system, they chose a system equally foreign to everyone. Unfortunately this gives Rasmussen little opportunity to study mental models built through heuristics, which I think is the missing piece here. Associations between different pieces of code based on the history of the system, its ownership and past behaviors/modifications is definitely a component of how the best engineers triage."
    },
    {
    "id": "16",
    "text": "Essentially the system produces a response and we ask our otherwise what internal values would combine to create a response. Today the tooling around formal methods is good enough to do this in something like TLA+ or Alloy if one is so inclined."
    },
    {
    "id": "17",
    "text": "I think the fact that we have such difficulty transitioning knowledge between engineers is not much of the model manipulation being described here is instinctual."
    },
    {
    "id": "18",
    "text": "This makes the operator sound a bit lazy. I go back to it being a cognitive load issue. Big, complex models demand more than they payoff."
    },
    {
    "id": "19",
    "text": "The advantage here that Rasmussen misses because he was not a mathematician (and the tooling wasn't advanced enough to make it pragmatic) is that expressing outputs as good/bad means you can also represent them as Booleans and model the entire interaction in logic."
    },
    {
    "id": "20",
    "text": "A behavior also observed when specifying systems in the first place."
    },
    {
    "id": "21",
    "text": "Again opening the door here to conversations about the degree to which search approach can be proactively designed. Can we manipulate the presentation of logs and debug statements to nudge operators towards the best search procedures?"
    },
    {
    "id": "21",
    "text": "In other words: take a walk and let your mind reset."
    },
    {
    "id": "23",
    "text": "I find it interesting that Rasmussen does not consider the difficulty of acquiring such detail in 1974 ... would be curious if these tendencies have changed for software engineers in a modern world where 1) Stackoverflow exists 2) lots of dependencies are in fact open sourced 3) the burden of \"taking something apart\" is less than it would be for a physical component that needs to be put back together."
    },
    {
    "id": "24",
    "text": "Kind of like how some software people advocate \"clean\" code, even when such constructions lead to long execution times for the function and less efficient output from the compiler. The preferred procedures of the system designer are perhaps \"more readable\" and easier to document in what feels like a repeatable fashion, but does that matter if the total runtime of triage is longer as a result? "
    }
    ],
    "references": [],
    "works": [
    {
    "link_title": "Original Paper",
    "link_url": "https://www.tandfonline.com/doi/abs/10.1080/00140137408931355"
    }
    ],
    "tags": [
    "triage",
    "ergonomics",
    "model",
    "mental model",
    "troubleshooting"
    ]
    }